#ifndef WORDS_H
#define WORDS_H

const char* sign [2]
{
    "",
    "минус "
};

const char* digitsWords [8] [10]
{
    // Мужской род
    {
         "ноль"  ,
         "один"  ,
         "два"   ,
         "три"   ,
         "четыре",
         "пять"  ,
         "шесть" ,
         "семь"  ,
         "восемь",
         "девять"
    },
    {
         "ноль"       ,
         "десять"     ,
         "двадцать"   ,
         "тридцать"   ,
         "сорок"      ,
         "пятдесят"   ,
         "шестьдесят" ,
         "семьдесят"  ,
         "восемьдесят",
         "девяносто"
    },
    {
         "ноль"     ,
         "сто"      ,
         "двести"   ,
         "тристо"   ,
         "четыресто",
         "пятьсот"  ,
         "шестьсот" ,
         "семьсот"  ,
         "восемьсот",
         "девятьсот"
    },
    {
         "десять"        ,
         "одиннадцать"   ,
         "двенадцать"    ,
         "тринадцать"    ,
         "четырнадцать"  ,
         "пятнадцать"    ,
         "шестнадцать"   ,
         "семнадцать"    ,
         "восемнадцать"  ,
         "девятнадцать"
    },
    // Женский род
    {
         "ноль"  ,
         "одна"  ,
         "две"   ,
         "три"   ,
         "четыре",
         "пять"  ,
         "шесть" ,
         "семь"  ,
         "восемь",
         "девять"
    },
    {
         "ноль"       ,
         "десять"     ,
         "двадцать"   ,
         "тридцать"   ,
         "сорок"      ,
         "пятдесят"   ,
         "шестьдесят" ,
         "семьдесят"  ,
         "восемьдесят",
         "девяносто"
    },
    {
         "ноль"     ,
         "сто"      ,
         "двести"   ,
         "тристо"   ,
         "четыресто",
         "пятьсот"  ,
         "шестьсот" ,
         "семьсот"  ,
         "восемьсот",
         "девятьсот"
    },
    {
         "десять"        ,
         "одиннадцать"   ,
         "двенадцать"    ,
         "тринадцать"    ,
         "четырнадцать"  ,
         "пятнадцать"    ,
         "шестнадцать"   ,
         "семнадцать"    ,
         "восемнадцать"  ,
         "девятнадцать"
    }
};

const char* sectorsNames [3] [3]
{
    {
     "рубль" ,
     "рубля" ,
     "рублей"
    },
    {
     "тысяча",
     "тысячи",
     "тысяч"
    },
    {
     "миллион"  ,
     "миллиона" ,
     "миллионов"
    }
};

#endif // WORDS_H
